*** Log
#+NAME: metrics-log
#+CAPTION: Weight, hip and waist measurements.
| Date                   | Weight |   Hip | Waist | Waist/Hip Ratio |
|------------------------+--------+-------+-------+-----------------|
| [2023-08-15 Tue 13:38] |   85.4 |    97 |    88 |      0.90721649 |
|------------------------+--------+-------+-------+-----------------|
| [2023-01-21 Sat 10:14] |   82.2 |    97 |    82 |      0.84536082 |
| [2023-01-11 Wed 13:54] |   82.1 |    96 |    83 |      0.86458333 |
| [2022-10-16 Sun 09:59] |   81.1 |    97 |    82 |      0.84536082 |
| [2022-09-26 Mon 09:56] |   80.5 |    97 |    82 |      0.84536082 |
| [2022-09-23 Fri 08:46] |   80.7 |    97 |    82 |      0.84536082 |
| [2022-09-19 Mon 15:37] |   80.1 |    97 |    82 |      0.84536082 |
| [2022-09-01 Thu 09:15] |   79.2 |    96 |    82 |      0.85416667 |
|------------------------+--------+-------+-------+-----------------|
| [2022-08-21 Sun 09:57] |   81.2 |    97 |    83 |      0.85567010 |
|------------------------+--------+-------+-------+-----------------|
| [2022-07-17 Sun 09:46] |   80.7 |    97 |    82 |      0.84536082 |
|------------------------+--------+-------+-------+-----------------|
| [2022-06-26 Sun 10:47] |   81.4 |    98 |    83 |      0.84693878 |
| [2022-06-21 Tue 07:59] |   81.5 |    98 |    83 |      0.84693878 |
| [2022-06-12 Sun 11:24] |   81.1 |    97 |    82 |      0.84536082 |
| [2022-06-05 Sun 10:55] |   81.3 |    98 |  81.5 |      0.83163265 |
|------------------------+--------+-------+-------+-----------------|
| [2022-05-24 Tue 08:00] |   81.3 |    98 |    82 |      0.83673469 |
| [2022-05-16 Mon 08:38] |   81.0 |    97 |    81 |      0.83505155 |
| [2022-05-13 Fri 08:49] |   81.5 |    97 |    81 |      0.83505155 |
|------------------------+--------+-------+-------+-----------------|
| [2022-04-26 Tue 08:15] |   81.6 |    97 |    81 |      0.83505155 |
| [2022-04-24 Sun 09:29] |   81.4 |    98 |    82 |      0.83673469 |
| [2022-04-18 Mon 14:41] |   81.9 |    97 |    82 |      0.84536082 |
| [2022-04-10 Sun 10:53] |   81.3 |    97 |    83 |      0.85567010 |
| [2022-04-03 Sun 11:01] |   81.8 |    98 |    82 |      0.83673469 |
|------------------------+--------+-------+-------+-----------------|
| [2022-03-21 Mon 17:22] |   81.5 |    97 |    82 |      0.84536082 |
| [2022-03-18 Fri 12:38] |   81.5 |    97 |  82.5 |      0.85051546 |
| [2022-03-15 Tue 13:30] |   81.5 |    97 |    82 |      0.84536082 |
| [2022-03-11 Fri 11:13] |   81.8 |    97 |  82.5 |      0.85051546 |
| [2022-03-09 Wed 15:41] |   82.4 |    97 |    84 |      0.86597938 |
| [2022-03-04 Fri 13:17] |   83.0 |    97 |    84 |      0.86597938 |
| [2022-02-12 Sat 11:20] |   82.9 |    96 |    83 |      0.86458333 |
| [2022-02-05 Sat 08:55] |   82.4 |    96 |    83 |      0.86458333 |
| [2022-02-02 Wed 14:46] |   82.3 |    96 |    83 |      0.86458333 |
|------------------------+--------+-------+-------+-----------------|
| [2022-01-31 Mon 13:04] |   82.3 |    97 |    83 |      0.85567010 |
| [2022-01-29 Sat 10:18] |   82.1 |    96 |    83 |      0.86458333 |
| [2022-01-26 Wed 13:51] |   82.9 |    97 |    83 |      0.85567010 |
| [2022-01-24 Mon 13:41] |   82.7 |    97 |    84 |      0.86597938 |
| [2022-01-19 Wed 13:41] |   82.7 |    97 |    84 |      0.86597938 |
| [2022-01-16 Sun 09:09] |   82.5 |    97 |    84 |      0.86597938 |
| [2022-01-14 Fri 13:32] |   82.4 |    97 |    84 |      0.86597938 |
| [2022-01-12 Wed 14:09] |   82.5 |    97 |    85 |      0.87628866 |
| [2022-01-10 Mon 10:04] |   83.2 |    97 |    84 |      0.86597938 |
| [2022-01-07 Fri 13:07] |   82.2 |    97 |    83 |      0.85567010 |
| [2022-01-05 Wed 13:15] |   82.8 |    98 |    84 |      0.85714286 |
| [2022-01-03 Mon 09:20] |   83.2 |    97 |    84 |      0.86597938 |
| [2022-01-01 Sat 09:51] |   83.0 |    98 |    84 |      0.85714286 |
|------------------------+--------+-------+-------+-----------------|
| [2021-12-29 Wed 10:13] |   83.1 |    98 |    84 |      0.85714286 |
| [2021-12-25 Sat 08:57] |   82.4 |    97 |    84 |      0.86597938 |
| [2021-12-22 Wed 14:17] |   82.5 |    97 |    84 |      0.86597938 |
| [2021-12-19 Sun 10:25] |   82.8 |    97 |    85 |      0.87628866 |
| [2021-12-15 Wed 13:38] |   82.6 |    97 |    83 |      0.85567010 |
| [2021-12-12 Sun 11:53] |   82.7 |    98 |    84 |      0.85714286 |
| [2021-12-03 Fri 12:23] |   82.8 |    98 |    85 |      0.86734694 |
|------------------------+--------+-------+-------+-----------------|
| [2021-11-29 Mon 08:11] |   82.7 |    98 |    85 |      0.86734694 |
| [2021-11-28 Sun 11:44] |   83.5 |    98 |    84 |      0.85714286 |
| [2021-11-23 Tue 12:57] |   82.7 |    99 |  84.5 |      0.85353535 |
| [2021-11-20 Sat 16:37] |   83.0 |    98 |    84 |      0.85714286 |
| [2021-11-18 Thu 13:36] |   83.0 |    99 |    85 |      0.85858586 |
| [2021-11-15 Mon 13:49] |   83.3 |    99 |    85 |      0.85858586 |
| [2021-11-13 Sat 10:03] |   83.5 |    99 |    85 |      0.85858586 |
| [2021-11-09 Tue 20:12] |   83.0 |    99 |    85 |      0.85858586 |
| [2021-11-05 Fri 16:39] |   83.2 |    99 |    85 |      0.85858586 |
| [2021-11-03 Wed 11:33] |   82.8 |    99 |    85 |      0.85858586 |
| [2021-11-02 Tue 15:09] |   83.5 |    99 |    85 |      0.85858586 |
|------------------------+--------+-------+-------+-----------------|
| [2021-10-31 Sun 18:51] |   83.5 |    99 |    85 |      0.85858586 |
| [2021-10-26 Tue 09:01] |   83.4 |    99 |    85 |      0.85858586 |
| [2021-10-22 Fri 11:58] |   84.2 |   100 |    86 |            0.86 |
| [2021-10-06 Wed 08:18] |   83.5 |   100 |    86 |            0.86 |
| [2021-10-04 Mon 08:38] |   83.5 |   100 |    86 |            0.86 |
|------------------------+--------+-------+-------+-----------------|
| [2021-09-20 Mon 09:07] |   84.3 |    98 |    86 |      0.87755102 |
| [2021-09-16 Thu 07:44] |   83.9 |    99 |    85 |      0.85858586 |
| [2021-09-14 Tue 10:46] |   83.9 |   100 |    87 |            0.87 |
| [2021-09-05 Sun 10:05] |   84.1 |   100 |    87 |            0.87 |
|------------------------+--------+-------+-------+-----------------|
| [2021-08-22 Sun 19:48] |   83.0 |   100 |    86 |            0.86 |
| [2021-08-19 Thu 09:01] |   83.5 |   100 |    87 |            0.87 |
| [2021-08-18 Wed 09:15] |   83.5 |   100 |    87 |            0.87 |
| [2021-08-08 Sun 09:20] |   83.6 |   100 |    87 |            0.87 |
|------------------------+--------+-------+-------+-----------------|
| [2021-07-28 Wed 08:37] |   83.0 |   100 |    87 |            0.87 |
| [2021-07-27 Tue 08:42] |   83.3 |   100 |    87 |            0.87 |
| [2021-07-26 Mon 09:49] |   84.1 |    99 |    87 |      0.87878788 |
| [2021-07-23 Fri 09:56] |   84.1 |   100 |    87 |            0.87 |
| [2021-07-20 Tue 08:02] |   84.2 |   100 |    87 |            0.87 |
| [2021-07-17 Sat 09:12] |   84.0 |   100 |    87 |            0.87 |
| [2021-07-14 Wed 09:08] |   84.0 |   100 |    87 |            0.87 |
| [2021-07-10 Sat 09:35] |   84.6 |   100 |    87 |            0.87 |
| [2021-07-06 Tue 09:45] |   84.2 |    99 |    87 |      0.87878788 |
| [2021-07-05 Mon 08:09] |   85.6 |   100 |    88 |            0.88 |
| [2021-07-02 Fri 09:13] |   84.5 |   100 |    87 |            0.87 |
|------------------------+--------+-------+-------+-----------------|
| [2021-06-29 Tue 19:43] |   86.0 |   100 |    88 |            0.88 |
| [2021-06-25 Fri 09:04] |   85.9 |   100 |    88 |            0.88 |
| [2021-06-22 Tue 09:12] |   85.1 |   100 |    88 |            0.88 |
| [2021-06-20 Sun 10:05] |   85.4 |   100 |    89 |            0.89 |
| [2021-06-17 Thu 08:25] |   86.1 |   101 |    89 |      0.88118812 |
| [2021-06-15 Tue 08:56] |   85.5 |   101 |    88 |      0.87128713 |
| [2021-06-10 Thu 10:35] |   85.5 |   102 |    91 |      0.89215686 |
| [2021-06-07 Mon 08:15] |   87.1 |   102 |    93 |      0.91176471 |
|------------------------+--------+-------+-------+-----------------|
| [2021-01-27 Wed 14:37] |   81.9 |   100 |    85 |            0.85 |
| [2021-01-21 Thu 10:43] |   81.3 |   100 |    85 |            0.85 |
| [2021-01-17 Sun 11:53] |   81.5 |   100 |    85 |            0.85 |
| [2021-01-16 Sat 14:43] |   81.9 |   100 |    86 |            0.86 |
| [2021-01-12 Tue 10:33] |   82.1 | 100.5 |  85.5 |      0.85074627 |
| [2021-01-10 Sun 12:42] |   81.7 | 100.5 |    86 |      0.85572139 |
| [2021-01-08 Fri 14:55] |   81.9 |   100 |    86 |            0.86 |
| [2021-01-06 Wed 09:55] |   82.4 |   100 |    86 |            0.86 |
| [2021-01-03 Sun 11:20] |   82.1 |   100 |    86 |            0.86 |
| [2021-01-01 Fri 13:21] |   82.1 |   100 |    86 |            0.86 |
|------------------------+--------+-------+-------+-----------------|
| [2020-12-30 Wed 11:07] |   82.7 |   100 |    86 |            0.86 |
| [2020-12-28 Mon 10:53] |   82.3 |   100 |    87 |            0.87 |
| [2020-12-27 Sun 09:38] |   82.6 |   100 |  86.5 |           0.865 |
| [2020-12-25 Fri 10:20] |   82.7 |   100 |    86 |            0.86 |
| [2020-12-23 Wed 09:54] |   82.6 |    99 |    86 |      0.86868687 |
| [2020-12-21 Mon 10:24] |   82.3 |   100 |  86.5 |           0.865 |
| [2020-12-19 Sat 15:16] |   82.1 |    99 |    87 |      0.87878788 |
| [2020-12-18 Fri 12:19] |   82.3 |    99 |    86 |      0.86868687 |
| [2020-12-16 Wed 10:11] |   82.1 |    98 |  85.5 |      0.87244898 |
| [2020-12-12 Sat 09:21] |   81.8 |    99 |    86 |      0.86868687 |
| [2020-12-11 Fri 11:26] |   82.3 |    99 |    86 |      0.86868687 |
| [2020-12-09 Wed 10:21] |   82.3 |    99 |    86 |      0.86868687 |
| [2020-12-06 Sun 11:37] |   82.1 |    99 |    86 |      0.86868687 |
| [2020-12-04 Fri 09:52] |   81.9 |    99 |    87 |      0.87878788 |
| [2020-12-02 Wed 13:39] |   81.7 |    99 |    87 |      0.87878788 |
|------------------------+--------+-------+-------+-----------------|
| [2020-11-30 Mon 10:57] |   81.5 |    98 |    86 |      0.87755102 |
| [2020-11-28 Sat 11:35] |   82.1 |    98 |    87 |      0.88775510 |
| [2020-11-26 Thu 10:31] |   82.2 |    99 |    85 |      0.85858586 |
| [2020-11-21 Sat 11:14] |   81.7 |    98 |    85 |      0.86734694 |
| [2020-11-18 Wed 10:07] |   81.7 |    98 |    85 |      0.86734694 |
| [2020-11-14 Sat 11:03] |   81.1 |    98 |    85 |      0.86734694 |
| [2020-11-12 Thu 13:09] |   81.5 |    97 |    85 |      0.87628866 |
| [2020-11-10 Tue 10:12] |   81.7 |    97 |    84 |      0.86597938 |
| [2020-11-08 Sun 11:27] |   80.7 |    97 |    85 |      0.87628866 |
| [2020-11-06 Fri 09:45] |   81.5 |    97 |    85 |      0.87628866 |
| [2020-11-04 Wed 10:30] |   81.2 |    97 |    85 |      0.87628866 |
| [2020-11-02 Mon 10:26] |   81.4 |    98 |    85 |      0.86734694 |
|------------------------+--------+-------+-------+-----------------|
| <2020-10-31 Sat>       |   80.7 |    97 |    85 |      0.87628866 |
| <2020-10-30 Fri>       |   81.2 |    97 |    85 |      0.87628866 |
| <2020-10-24 Sat>       |   81.0 |    97 |  84.5 |      0.87113402 |
| <2020-10-22 Thu>       |   81.3 |    96 |    86 |      0.89583333 |
| <2020-10-18 Sun>       |   80.7 |    97 |    84 |      0.86597938 |
| <2020-10-15 Thu>       |   81.3 |    97 |    83 |      0.85567010 |
| <2020-10-12 Mon>       |   80.9 |    97 |    84 |      0.86597938 |
| <2020-10-11 Sun>       |   81.5 |    97 |  84.5 |      0.87113402 |
| <2020-10-09 Fri>       |   81.7 |  97.5 |    85 |      0.87179487 |
| <2020-10-04 Sun>       |   81.3 |    97 |    84 |      0.86597938 |
| <2020-10-02 Fri>       |   81.3 |    97 |    84 |      0.86597938 |
| <2020-09-30 Wed>       |   81.6 |    97 |    84 |      0.86597938 |
| <2020-09-28 Mon>       |   81.0 |    97 |    84 |      0.86597938 |
|------------------------+--------+-------+-------+-----------------|
| <2020-09-20 Sun>       |   81.9 |    97 |    85 |      0.87628866 |
| <2020-09-15 Tue>       |   80.9 |    97 |    85 |      0.87628866 |
|------------------------+--------+-------+-------+-----------------|
| <2020-09-12 Sat>       |   81.5 |    97 |    85 |      0.87628866 |
| <2020-09-09 Wed>       |   81.9 |    97 |    85 |      0.87628866 |
| <2020-09-07 Mon>       |   81.3 |    97 |    85 |      0.87628866 |
|------------------------+--------+-------+-------+-----------------|
| <2020-09-05 Sat>       |   82.0 |    97 |    86 |      0.88659794 |
| <2020-09-03 Thu>       |   81.9 |    97 |    85 |      0.87628866 |
| <2020-09-02 Wed>       |   81.9 |    97 |    85 |      0.87628866 |
|------------------------+--------+-------+-------+-----------------|
| <2020-08-27 Thu>       |   82.0 |    98 |    86 |      0.87755102 |
| <2020-08-26 Wed>       |   82.3 |    98 |    86 |      0.87755102 |
| <2020-08-24 Mon>       |   81.7 |    98 |    86 |      0.87755102 |
|------------------------+--------+-------+-------+-----------------|
| <2020-08-22 Sat>       |   81.1 |    98 |    86 |      0.87755102 |
| <2020-08-19 Wed>       |   81.8 |    98 |    86 |      0.87755102 |
| <2020-08-17 Mon>       |   81.3 |    98 |    86 |      0.87755102 |
|------------------------+--------+-------+-------+-----------------|
| <2020-08-15 Sat>       |   82.3 |    98 |    85 |      0.86734694 |
| <2020-08-13 Thu>       |   81.6 |    98 |    85 |      0.86734694 |
| <2020-08-11 Tue>       |   82.1 |    98 |    86 |      0.87755102 |
| <2020-08-10 Mon>       |   81.5 |    98 |    86 |      0.87755102 |
|------------------------+--------+-------+-------+-----------------|
| <2020-08-05 Wed>       |   81.3 |    98 |    86 |      0.87755102 |
| <2020-08-04 Tue>       |   82.2 |    98 |    87 |      0.88775510 |
| <2020-08-03 Mon>       |   83.4 |    98 |    87 |      0.88775510 |
|------------------------+--------+-------+-------+-----------------|
| <2020-08-02 Sun>       |   83.4 |    98 |    87 |      0.88775510 |
|------------------------+--------+-------+-------+-----------------|
| <2020-07-24 Fri>       |   82.3 |    98 |    86 |      0.87755102 |
| <2020-07-23 Thu>       |   82.3 |    98 |    86 |      0.87755102 |
| <2020-07-22 Wed>       |   82.2 |    98 |    86 |      0.87755102 |
| <2020-07-21 Tue>       |   81.6 |    98 |    86 |      0.87755102 |
| <2020-07-20 Mon>       |   82.4 |    98 |    86 |      0.87755102 |
|------------------------+--------+-------+-------+-----------------|
| <2020-07-19 Sun>       |   82.8 |    98 |    86 |      0.87755102 |
| <2020-07-16 Thu>       |   81.9 |    98 |    86 |      0.87755102 |
| <2020-07-14 Tue>       |   82.6 |    98 |    87 |      0.88775510 |
| <2020-07-13 Mon>       |   81.8 |    98 |    87 |      0.88775510 |
|------------------------+--------+-------+-------+-----------------|
| <2020-07-12 Sun>       |   83.0 |    98 |    87 |      0.88775510 |
| <2020-07-11 Sat>       |   83.0 |    98 |    87 |      0.88775510 |
| <2020-07-09 Thu>       |   82.6 |    98 |    87 |      0.88775510 |
| <2020-07-08 Wed>       |   82.4 |    98 |    87 |      0.88775510 |
| <2020-07-07 Tue>       |   81.4 |    98 |    88 |      0.89795918 |
| <2020-07-06 Mon>       |   82.4 |    98 |    87 |      0.88775510 |
|------------------------+--------+-------+-------+-----------------|
| <2020-07-05 Sun>       |   82.0 |    98 |    87 |      0.88775510 |
| <2020-07-04 Sat>       |   83.1 |    98 |    87 |      0.88775510 |
| <2020-07-03 Fri>       |   83.0 |    98 |    88 |      0.89795918 |
| <2020-07-02 Thu>       |   83.3 |    98 |    89 |      0.90816327 |
| <2020-07-01 Wed>       |   83.3 |    98 |    89 |      0.90816327 |
| <2020-06-30 Tue>       |   82.7 |    98 |    88 |      0.89795918 |
| <2020-06-29 Mon>       |   83.8 |    98 |    89 |      0.90816327 |
|------------------------+--------+-------+-------+-----------------|
| <2020-06-25 Thu>       |   81.9 |    98 |    88 |      0.89795918 |
| <2020-06-24 Wed>       |   83.1 |    98 |    89 |      0.90816327 |
| <2020-06-23 Tue>       |   82.1 |    98 |    90 |      0.91836735 |
|------------------------+--------+-------+-------+-----------------|
| <2020-06-21 Sun>       |   82.8 |    98 |    89 |      0.90816327 |
| <2020-06-20 Sat>       |   83.0 |    98 |    90 |      0.91836735 |
| <2020-06-19 Fri>       |   83.0 |    98 |    89 |      0.90816327 |
| <2020-06-19 Thu>       |   84.1 |    98 |    92 |      0.93877551 |
#+TBLFM: $5=($4 / $3)
#+begin_src R :session *training-R* :eval yes :exports none :var metrics_table=metrics-log :colnames nil :results output silent
  metrics_table <- metrics_table %>%
      dplyr::filter(!is.na(Weight)) %>%
      mutate(Date = str_extract(Date, "[0-9]+-[0-9]+-[0-9]+"),
             date = ymd(Date),
             waist_hip = Waist / Hip) %>%
      select(c(date, Weight, Hip, Waist, waist_hip))
#+end_src
